#+PROPERTY: header-args:sql  :tangle ./test.sql :engine postgres

#+name: front-page-events
#+begin_src sql
  SELECT events.id, events.title FROM events;
#+end_src

#+RESULTS: front-page-events
| id                                   | title              |
|--------------------------------------+--------------------|
| b0ded263-080b-4301-a563-54c493adacac | Lol bro what       |
| b68c2160-1fd4-4cca-88b5-3963d397b6a2 | Nested event title |

#+name: past-events
#+begin_src sql
  SELECT events.id, events.title, (events.end_time - events.start_time) AS interval FROM events WHERE events.start_time < now();
#+end_src

#+RESULTS: past-events
| id                                   | title              | interval |
|--------------------------------------+--------------------+----------|
| b0ded263-080b-4301-a563-54c493adacac | Lol bro what       | 01:00:00 |
| b68c2160-1fd4-4cca-88b5-3963d397b6a2 | Nested event title | 01:00:00 |

#+name: groups
#+begin_src sql
  SELECT groups.name, groups.slug, source, source_link FROM groups;
#+end_src
#+RESULTS: groups
| name        | slug    | source | source_link |
|-------------+---------+--------+-------------|
| Lol bro wtf | entropy | local  |             |

#+name: event_sections
#+begin_src sql
    SELECT
      events.slug,
      logo,
      format('%s mins', extract(epoch from (event_sections.end_time - event_sections.start_time))/60) as duration
      FROM
        ("event_sections" INNER JOIN "events" ON "events"."id" = "event_sections"."event_id");
#+end_src
#+RESULTS: event_sections
| slug          | logo                      | duration |
|---------------+---------------------------+----------|
| lol-rofl-lmao | logos/dark/lightening.svg | 30 mins  |

#+name: initiatives
#+begin_src sql :engine postgres
  SELECT initiatives.slug from initiatives left join goals on initiatives.slug = goals.initiative_slug where goals.slug is null;
#+end_src
#+RESULTS: initiatives
| slug         |
|--------------|
| fear-of-cops |

#+name: goals
#+begin_src sql :engine postgres
  SELECT
    title, slug, initiative_slug, target,
    justify_interval(iteration_interval) AS iteration_interval
  FROM goals;
#+end_src
#+RESULTS: goals
| title                   | slug                     | initiative_slug     | target | iteration_interval |
|-------------------------+--------------------------+---------------------+--------+--------------------|
| 10 monthly active users | ten-monthly-active-users | meager-tech-culture |     10 | 7 days             |
